[
  {
    "id": 1,
    "title": "OpenAI Releases GPT-5 Preview with 50% Performance Improvement",
    "summary": "OpenAI today released a preview version of GPT-5, with significant improvements in reasoning, creative writing, and code generation. Internal tests show that GPT-5's performance in various benchmarks is approximately 50% better than GPT-4.",
    "category": "Large Language Models",
    "readTime": "3 min read",
    "publishTime": "2 hours ago",
    "date": "2025-08-27",
    "weekday": "Wednesday",
    "views": 1250,
    "comments": 45,
    "isBreaking": true
  },
  {
    "id": 2,
    "title": "Google's Gemini Ultra Achieves Breakthrough in Medical Diagnosis",
    "summary": "Google's latest Gemini Ultra model excels in medical image analysis, accurately identifying early-stage cancer lesions with an accuracy rate of 96.7%. This breakthrough promises to revolutionize the field of medical diagnosis.",
    "category": "Medical AI",
    "readTime": "5 min read",
    "publishTime": "4 hours ago",
    "date": "2025-08-27",
    "weekday": "Wednesday",
    "views": 890,
    "comments": 32
  },
  {
    "id": 3,
    "title": "Autonomous Vehicles Reach New Milestone in Urban Testing",
    "summary": "Tesla's FSD system has completed 100,000 kilometers of driverless testing in complex urban environments without human intervention, marking a significant step towards the commercial application of autonomous driving technology.",
    "category": "Autonomous Driving",
    "readTime": "4 min read",
    "publishTime": "6 hours ago",
    "date": "2025-08-27",
    "weekday": "Wednesday",
    "views": 756,
    "comments": 28
  },
  {
    "id": 4,
    "title": "AI Chip Market Expected to Grow 40% in 2025",
    "summary": "According to the latest market report, the global AI chip market is expected to reach $65 billion in 2025, with rapid year-on-year growth. Companies like NVIDIA, AMD, and Intel are increasing their investments.",
    "category": "Hardware",
    "readTime": "3 min read",
    "publishTime": "8 hours ago",
    "date": "2025-08-26",
    "weekday": "Tuesday",
    "views": 623,
    "comments": 19
  },
  {
    "id": 5,
    "title": "New Applications of Machine Learning in Climate Prediction",
    "summary": "Scientists have developed a new climate model using deep learning technology that can more accurately predict extreme weather events. The model achieved an accuracy rate of 89% during testing over the past year.",
    "category": "Scientific Research",
    "readTime": "6 min read",
    "publishTime": "12 hours ago",
    "date": "2025-08-26",
    "weekday": "Tuesday",
    "views": 445,
    "comments": 15
  },
  {
    "id": 6,
    "title": "ChatGPT Enterprise Users Surpass 1 Million",
    "summary": "OpenAI announced that the number of ChatGPT Enterprise users has exceeded 1 million, with continued growth in demand for AI tools from business customers. The platform has helped businesses improve average工作效率 by 30%.",
    "category": "Business Applications",
    "readTime": "2 min read",
    "publishTime": "1 day ago",
    "date": "2025-08-25",
    "weekday": "Monday",
    "views": 1120,
    "comments": 67
  },
  {
    "id": 7,
    "title": "Microsoft Launches Copilot Pro with GPT-5 Integration",
    "summary": "Microsoft announced the launch of the Copilot Pro subscription service, integrating OpenAI's latest GPT-5 model to provide a professional-level AI assistant experience for individual users.",
    "category": "Business Applications",
    "publishTime": "1 day ago",
    "date": "2025-08-25",
    "weekday": "Monday",
    "views": 980,
    "comments": 45
  },
  {
    "id": 8,
    "title": "Copyright Issues with AI-Generated Content Spark Legal Disputes",
    "summary": "As AI-generated content becomes more prevalent, copyright ownership issues are becoming increasingly prominent, with multiple related lawsuits underway that could impact the entire industry's development direction.",
    "category": "Legal & Ethics",
    "readTime": "3 min read",
    "publishTime": "1 day ago",
    "date": "2025-08-25",
    "weekday": "Monday",
    "views": 870,
    "comments": 52
  },
  {
    "id": 9,
    "title": "Meta Releases Llama 3.1, Open-Source Large Models Achieve Another Breakthrough",
    "summary": "Meta announced the release of the Llama 3.1 series of large models, with parameter scales ranging from 8B to 405B, performing excellently in multiple benchmark tests.",
    "category": "Large Language Models",
    "readTime": "3 min read",
    "publishTime": "2 days ago",
    "date": "2025-08-24",
    "weekday": "Sunday",
    "views": 1340,
    "comments": 78
  },
  {
    "id": 10,
    "title": "AI Painting Tool Midjourney Releases Version 6.0",
    "summary": "Midjourney 6.0 brings significant improvements in image quality and new style options, allowing users to create more realistic and detailed images.",
    "category": "Creative Generation",
    "readTime": "4 min read",
    "publishTime": "2 days ago",
    "date": "2025-08-24",
    "weekday": "Sunday",
    "views": 920,
    "comments": 41
  },
  {
    "id": 11,
    "title": "NVIDIA Launches New H200 AI Chip with 30% Performance Improvement",
    "summary": "NVIDIA today released the new H200 AI training chip, which offers a 30% improvement in AI training and inference performance and a 25% improvement in energy efficiency compared to the previous H100.",
    "category": "Hardware",
    "readTime": "3 min read",
    "publishTime": "3 days ago",
    "date": "2025-08-23",
    "weekday": "Saturday",

    "views": 1560,
    "comments": 89
  },
  {
    "id": 12,
    "title": "AI Assistant Adoption Rate in Software Engineering Reaches 68%",
    "summary": "A recent survey shows that 68% of global software engineers use AI-assisted programming tools in their daily work, with 85% of respondents stating that AI has improved their productivity.",
    "category": "Business Applications",
    "readTime": "2 min read",
    "publishTime": "3 days ago",
    "date": "2025-08-23",
    "weekday": "Saturday",
    "views": 890,
    "comments": 36
  },
  {
    "id": 13,
    "title": "Tsinghua University Releases Chinese Large Model THUDM-10B",
    "summary": "Tsinghua University's Artificial Intelligence Research Institute released the new generation Chinese large model THUDM-10B, which outperforms several international mainstream models in Chinese understanding and generation tasks.",
    "category": "Large Language Models",
    "readTime": "4 min read",
    "publishTime": "4 days ago",
    "date": "2025-08-22",
    "weekday": "Friday",
    "views": 1230,
    "comments": 67
  },
  {
    "id": 14,
    "title": "AI Diagnostic System Achieves 99.2% Accuracy in COVID-19 Detection",
    "summary": "An AI diagnostic system based on deep learning performed excellently in COVID-19 detection, achieving an accuracy rate of 99.2%, which is 5 times faster than traditional detection methods.",
    "category": "Medical AI",
    "readTime": "5 min read",
    "publishTime": "4 days ago",
    "date": "2025-08-22",
    "weekday": "Friday",
    "views": 950,
    "comments    ": 42
  },
  {
    "id": 15,
    "title": "AI Ethics Framework Officially Released, Industry Standards Gradually Forming",
    "summary": "An AI ethics framework jointly developed by several tech giants and research institutions was officially released today, providing guiding principles for the responsible development of AI technology.",
    "category": "Legal & Ethics",
    "readTime": "3 min read",
    "publishTime": "5 days ago",
    "date": "2025-08-21",
    "weekday": "Thursday",
    "views": 780,
    "comments": 53
  },
  {
    "id": 16,
    "title": "Apple Announces AI-Assisted Features, iOS 18 to Include Generative AI",
    "summary": "Apple announced at its developer conference that iOS 18 will include generative AI features, including smart assistant upgrades and content generation tools.",
    "category": "Business Applications",
    "readTime": "3 min read",
    "publishTime": "5 days ago",
    "date": "2025-08-21",
    "weekday": "Thursday",
    "views": 1780,
    "comments": 124
  },
  {
    "id": 17,
    "title": "Number of Open-Source AI Models Exceeds 1,000, Community Contributions Continue to Grow",
    "summary": "According to the latest statistics, the number of open-source AI models worldwide has exceeded 1,000, with over 40% released in the past year.",
    
    "category": "Large Language Models",
    "readTime": "2 min read",
    "publishTime": "6 days ago",
    "date": "2025-08-20",
    "weekday": "Wednesday",
    "views": 650,
    "comments": 28
  },
  {
    "id": 18,
    "title": "AI Application in Financial Fraud Detection Reduces Losses by $3 Billion",
    "summary": "After adopting AI fraud detection systems, the financial industry reduced fraud losses by approximately $3 billion in the past year, with a detection accuracy rate of 97%.",
    "category": "Business Applications",
    "readTime": "4 min read",
    "publishTime": "6 days ago",
    "date": "2025-08-20",
    "weekday": "Wednesday",
    "views": 890,
    "comments": 35
  },
  {
    "id": 19,
    "title": "Autonomous Truck Completes 3,000 km Cross-State Transport Test",
    "summary": "An autonomous truck successfully completed a 3,000 km cross-state transport test from California to Texas without human intervention, marking a significant advancement in the commercial application of autonomous driving technology.",
    "category": "Autonomous Driving",
    "readTime": "5 min read",
    "publishTime": "7 days ago",
    "date": "2025-08-19",
    "weekday": "Tuesday",
    "views": 1120,
    "comments": 76
  },
  {
    "id": 20,
   
    "title": "AI-Generated Music Work Nominated for Grammy Award for the First Time",
    "summary": "A music work generated by AI has been nominated for a Grammy Award for the first time, sparking discussions about the boundaries between AI creation and human creation.",
    "category": "Creative Generation",
    "readTime": "3 min read",
    "publishTime": "7 days ago",
    "date": "2025-08-19",
    "weekday": "Tuesday",
    "views": 1450,
    "comments": 98
  },
  {
    "id": 21,
    "title": "Major Breakthrough in Quantum Computing and AI Integration Research",
    "summary": "Scientists have made a major breakthrough in quantum computing and AI integration research, successfully running machine learning algorithms on a quantum computer, which is 100 times faster than traditional computers.",
    "category": "Scientific Research",
    "readTime": "6 min read",
    "publishTime": "8 days ago",
    "date": "2025-08-18",
    "weekday": "Monday",
    "views": 780,
    "comments": 43
  },
  {
    "id": 22,
    "title": "Global AI Talent Shortage Reaches 3 Million, Salaries Continue to Rise",
    "summary": "A latest report shows that the global AI talent shortage has reached 3 million, with the average salary for AI-related positions increasing by 25% in the past year.",
    "category": "Business Applications",
    "readTime": "3 min read",
    "publishTime": "8 days ago",
    "date": "2025-08-18",
    "weekday": "Monday",
    "views": 920,
    "comments": 51
  },
  {
    "id": 23,
    "title": "AI-Assisted Education Platform Users Exceed 50 Million",
    "summary": "The number of global users of an AI-assisted education platform has exceeded 50 million, covering education from elementary school to university across all age groups.",
    "category": "Business Applications",
    "readTime": "2 min read",
    "publishTime": "9 days ago",
    "date": "2025-08-17",
    "weekday": "Sunday",
    "views": 650,
    "comments": 29
  },
  {
    "id": 24,
    "title": "AI Application in Materials Science Accelerates New Material Development",
    "summary": "The application of AI technology in materials science has significantly accelerated the development process of new materials, reducing the traditional R&D cycle from several years to several months.",
    "category": "Scientific Research",
    "readTime": "4 min read",
    "publishTime": "9 days ago",
    "date": "2025-08-17",
    "weekday": "Sunday",
    "views": 580,
    "comments": 24
  },
  {
    "id": 25,
    "title": "EU AI Act Officially Passed, Becomes World's First Comprehensive AI Regulation",
    "summary": "The EU AI Act has been officially passed, becoming the world's first comprehensive AI regulation, setting clear requirements for the transparency, safety, and ethics of AI systems.",
    "category": "Legal & Ethics",
    "readTime": "5 min read",
    "publishTime": "10 days ago",
    "date": "2025-08-16",
    "weekday": "Saturday",
    "views": 1340,
    "comments": 95
  },
  {
    "id": 26,
    "title": "AI-Generated Video Quality Reaches Professional Level for the First Time",
    "summary": "The latest AI video generation technology can now produce video content at a professional level, being mistaken for real footage in multiple tests.",
    "category": "Creative Generation",
    "readTime": "4 min read",
    "publishTime": "10 days ago",
    "date": "2025-08-16",
    "weekday": "Saturday",
    "views": 1650,
    "comments": 112
  },
  {
    "id": 27,
    "title": "Brain-Computer Interface Technology Combined with AI Helps Paralyzed Patients Regain Communication Ability",
    "summary": "The combination of brain-computer interface technology and AI has made a breakthrough, successfully helping a patient with high-level paralysis to communicate by controlling a computer with their thoughts.",
    "category": "Medical AI",
    "readTime": "6 min read",
    "publishTime": "11 days ago",
    "date": "2025-08-15",
    "weekday": "Friday",
    "views": 1280,
    "comments": 87
  },
  {
    "id": 28,
    "title": "AI Translation Technology Breaks Language Barriers with 99.5% Accuracy",
    "summary": "The latest AI translation technology has achieved an accuracy rate of 99.5% in translating common language pairs,接近 human professional translation level.",
    "category": "Large Language Models",
    "readTime": "3 min read",
    "publishTime": "11 days ago",
    "date": "2025-08-15",
    "weekday": "Friday",
    "views": 890,
    "comments": 45
  },
  {
    "id": 29,
    "title": "AI Prediction Model Successfully Predicts 3 Earthquakes with 85% Accuracy",
    "summary": "A machine learning-based earthquake prediction model successfully predicted 3 moderate-intensity earthquakes in the past month with an accuracy rate of 85%.",
    "category": "Scientific Research",
    "readTime": "5 min read",
    "publishTime": "12 days ago",
    "date": "2025-08-14",
    "weekday": "Thursday",
    "views": 1560,
    "comments": 103
  },
  {
    "id": 30,
    "title": "World's Largest AI Computing Center Built in Guizhou with Exascale Computing Power",
    "summary": "The world's largest AI computing center has been built and put into operation in Guizhou Province, with computing power reaching exascale (hundreds of billions of calculations per second), providing strong support for AI research and development.",
    "category": "Hardware",
    "readTime": "4 min read",
    "publishTime": "12 days ago",
    "date": "2025-08-14",
    "weekday": "Thursday",
    "views": 1120,
    "comments": 76
  }
]